tap "homebrew/bundle"
tap "homebrew/services"
tap "kardolus/chatgpt-cli"
tap "steipete/tap"
brew "act"
brew "libtiff"
brew "jpeg-xl"
brew "aom"
brew "bash"
brew "bash-completion"
brew "bat"
brew "glib"
brew "cairo"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "docker-compose"
brew "findutils"
brew "libavif"
brew "gd"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "git"
brew "glslang"
brew "gnu-sed"
brew "gnutls"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gopass"
brew "grep"
brew "libheif"
brew "imagemagick"
brew "jj"
brew "jq"
brew "python@3.12"
brew "liblqr"
brew "libraw"
brew "libxmlsec1"
brew "mackup"
brew "mise"
brew "mockery"
brew "moreutils"
brew "ncdu"
brew "oath-toolkit"
brew "openjdk"
brew "openjdk@11"
brew "pam-u2f"
brew "php"
brew "postgresql@14", restart_service: :changed
brew "python@3.11"
brew "qemu"
brew "redis", restart_service: :changed
brew "rename"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "trash", link: true
brew "yarn"
brew "yq"
brew "kardolus/chatgpt-cli/chatgpt-cli"
brew "steipete/tap/goplaces"
brew "steipete/tap/summarize"
cask "buttercup"
cask "claude"
cask "claude-code"
cask "gcloud-cli"
cask "iterm2"
cask "qbittorrent"
cask "spotify"
cask "steam"
cask "tableplus"
cask "visual-studio-code"
cask "vlc"
vscode "adpyke.vscode-sql-formatter"
vscode "arcanis.vscode-zipfs"
vscode "ctf0.macros"
vscode "dae.vscode-mac-color-picker"
vscode "dbaeumer.vscode-eslint"
vscode "oxc.oxc-vscode"
vscode "foxundermoon.shell-format"
vscode "geddski.macros"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hipstersmoothie-public.github-dark-high-contrast"
vscode "humao.rest-client"
vscode "mechatroner.rainbow-csv"
vscode "ms-vscode.live-server"
vscode "sleistner.vscode-fileutils"
vscode "slevesque.shader"
vscode "stevensona.shader-toy"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
vscode "xaver.clang-format"
go "github.com/wneessen/apg-go/cmd/apg"
go "github.com/tcodes0/go/cmd/changelog"
go "golang.org/x/tools/cmd/cover"
go "golang.org/x/tools/go/analysis/passes/defers/cmd/defers"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/go/analysis/passes/fieldalignment/cmd/fieldalignment"
go "golang.org/x/tools/go/analysis/passes/findcall/cmd/findcall"
go "github.com/ramya-rao-a/go-outline"
go "github.com/joho/godotenv/cmd/godotenv"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/gotesttools/gotestfmt/v2/cmd/gotestfmt"
go "github.com/cweill/gotests/gotests"
go "golang.org/x/tools/go/analysis/passes/httpmux/cmd/httpmux"
go "golang.org/x/tools/go/analysis/passes/ifaceassert/cmd/ifaceassert"
go "github.com/josharian/impl"
go "golang.org/x/tools/go/analysis/passes/lostcancel/cmd/lostcancel"
go "golang.org/x/tools/go/analysis/passes/nilness/cmd/nilness"
go "golang.org/x/tools/go/analysis/passes/shadow/cmd/shadow"
go "honnef.co/go/tools/cmd/staticcheck"
go "golang.org/x/tools/go/analysis/passes/stringintconv/cmd/stringintconv"
go "github.com/4meepo/tagalign/cmd/tagalign"
go "golang.org/x/tools/go/analysis/passes/unmarshal/cmd/unmarshal"
go "golang.org/x/tools/go/analysis/passes/unusedresult/cmd/unusedresult"
